docs/math/category-theory/internalization.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-11 Sun 18:30 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Internalization</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Internalization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-923acfcf-6267-4736-98c7-5aeb64ec61b5">1. Overview</a></li>
<li><a href="#h-9ad164db-5835-44a6-ba5b-e23a88c765db">2. Example: Internal Category</a>
<ul>
<li><a href="#h-f97cc2c3-ed7a-4c54-9172-c38264185ae0">2.1. Internal Functors</a></li>
</ul>
</li>
<li><a href="#h-00a2a0ab-3f32-44b4-85bb-1244a6ff40f9">3. Other Examples</a></li>
<li><a href="#h-a1539fb0-10c1-4691-8436-d0edc792bc37">4. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-923acfcf-6267-4736-98c7-5aeb64ec61b5" class="outline-2">
<h2 id="h-923acfcf-6267-4736-98c7-5aeb64ec61b5"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-h-923acfcf-6267-4736-98c7-5aeb64ec61b5">
<p>
The intuition is, just as we define a "mathematical gadget" to consist
of "stuff" equipped with "structure" such that a bunch of "properties"
hold, we can model this by using <i>objects</i> instead of "stuff",
<i>morphisms</i> for "structure", and commutative diagrams for "properties".
This gives us an "internal gadget" relative to a category.
</p>
</div>
</div>

<div id="outline-container-h-9ad164db-5835-44a6-ba5b-e23a88c765db" class="outline-2">
<h2 id="h-9ad164db-5835-44a6-ba5b-e23a88c765db"><span class="section-number-2">2</span> Example: Internal Category</h2>
<div class="outline-text-2" id="text-h-9ad164db-5835-44a6-ba5b-e23a88c765db">
<div id="defn-cat-object" class="definition">
<p>
Let \(A\) be a category with pullbacks.
An <dfn>Category Object</dfn> internal to \(A\) consists of
</p>
<ul class="org-ul">
<li>an object of <i>objects</i> \(C_{0}\in A\)</li>
<li>an object of <i>morphisms</i> \(C_{1}\in A\)</li>
</ul>

<p>
equipped with
</p>
<ul class="org-ul">
<li>source and target morphisms \(s,t\colon C_{1}\to C_{0}\)</li>
<li>an identity-assigning morphism \(e\colon C_{0}\to C_{1}\)</li>
<li>a composition morphism \(c\colon C_{1}\times_{C_{0}}C_{1}\to C_{1}\)</li>
</ul>

<p>
such that the following diagrams expressing category laws hold,
specifying the source of identity morphisms:
</p>
\begin{equation}
\require{AMScd}
\begin{CD}
C_{0} @>e>> C_{1}\\
@V1VV       @VVsV \\
C_{0} @=    C_{0}
\end{CD}
\end{equation}
<p>
For the target of identity morphisms
</p>
\begin{equation}
\begin{CD}
C_{0} @>e>> C_{1}\\
@V1VV       @VVtV \\
C_{0} @=    C_{0}
\end{CD}
\end{equation}
<p>
The source of a composite morphism:
</p>
\begin{equation}
\begin{CD}
C_{1}\times_{C_{0}}C_{1} @>c>> C_{1}\\
@Vp_{1}VV       @VVsV \\
C_{1} @>s>>    C_{0}
\end{CD}
\end{equation}
<p>
The target of a composite morphism:
</p>
\begin{equation}
\begin{CD}
C_{1}\times_{C_{0}}C_{1} @>c>> C_{1}\\
@Vp_{2}VV       @VVsV \\
C_{1} @>t>>    C_{0}
\end{CD}
\end{equation}
<p>
Associativity for composition of morphisms:
</p>
\begin{equation}
\begin{CD}
C_{1}\times_{C_{0}}C_{1}\times_{C_{0}}C_{1} @>c\times_{C_{0}}1>> C_{1}\times_{C_{0}}C_{1}\\
@V1\times_{C_{0}}cVV       @VVcV \\
C_{1}\times_{C_{0}}C_{1} @>c>>    C_{0}
\end{CD}
\end{equation}
<p>
The left and right unit laws for composition:
</p>
\begin{equation}
\begin{CD}
C_{1}\times_{C_{0}}C_{1} @>e\times_{C_{0}}1>> C_{1}\times_{C_{0}}C_{1} @<1\times_{C_{0}}e<< C_{1}\times_{C_{0}}C_{1}\\
@Vp_{2}VV           @VVcV                        @VVp_{2}V \\
C_{1} @=    C_{1}             @= C_{1}
\end{CD}
\end{equation}
<p>
Note, here the pullback \(C_{1}\times_{C_{0}}C_{1}\) is defined by the
square
</p>
\begin{equation}
\begin{CD}
C_{1}\times_{C_{0}}C_{1} @>p_{2}>> C_{1}\\
@Vp_{1}VV       @VVsV \\
C_{1} @>t>>    C_{0}
\end{CD}
\end{equation}

</div>
</div>

<div id="outline-container-h-f97cc2c3-ed7a-4c54-9172-c38264185ae0" class="outline-3">
<h3 id="h-f97cc2c3-ed7a-4c54-9172-c38264185ae0"><span class="section-number-3">2.1</span> Internal Functors</h3>
<div class="outline-text-3" id="text-h-f97cc2c3-ed7a-4c54-9172-c38264185ae0">
<p>
When the ambient category \(A\) does not satisfy the <a href="axiom-of-choice.html">axiom of choice</a>, it
is often better to use anafunctors instead of "vanilla functors".
</p>

<div id="defn-internal-functor" class="definition">
<p>
Let \(C\), \(D\) be internal categories in some ambient category \(A\), then
an <dfn>Internal Functor</dfn> \(F\colon C\to D\) is
</p>
<ul class="org-ul">
<li>a morphism of objects \(F_{0}\colon C_{0}\to D_{0}\) in \(A\)</li>
<li>a morphism of morphisms \(F_{1}\colon C_{1}\to D_{1}\) in \(A\)</li>
</ul>

<p>
such that it respects the source map
</p>
\begin{equation}
\begin{CD}
C_{1} @>f_{1}>> D_{1}\\
@VsVV       @VVsV \\
C_{0} @>f_{0}>>    D_{0}
\end{CD}
\end{equation}
<p>
Functors respect the target map:
</p>
\begin{equation}
\begin{CD}
C_{1} @>f_{1}>> D_{1}\\
@VtVV       @VVtV \\
C_{0} @>f_{0}>>    D_{0}
\end{CD}
\end{equation}
<p>
It respects identity morphisms:
</p>
\begin{equation}
\begin{CD}
C_{0} @>f_{0}>> D_{0}\\
@VeVV       @VVeV \\
C_{1} @>f_{1}>>    D_{1}
\end{CD}
\end{equation}
<p>
Functors preserve composing "internal morphisms":
</p>
\begin{equation}
\begin{CD}
C_{1}\times_{C_{0}}C_{1} @>f_{1}\times_{C_{0}}f_{1}>> D_{1}\times_{D_{0}}D_{1}\\
@VcVV       @VVcV \\
C_{1} @>f_{1}>>    D_{1}
\end{CD}
\end{equation}
<p>
where \(f_{1}\times_{C_{0}}f_{1}\) is the unique morphisms defined by the
universal property of pullbacks.
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-h-00a2a0ab-3f32-44b4-85bb-1244a6ff40f9" class="outline-2">
<h2 id="h-00a2a0ab-3f32-44b4-85bb-1244a6ff40f9"><span class="section-number-2">3</span> Other Examples</h2>
<div class="outline-text-2" id="text-h-00a2a0ab-3f32-44b4-85bb-1244a6ff40f9">
<ul class="org-ul">
<li><a href="monoid-object.html">Monoid Object</a> internal to any monoidal category</li>
<li><a href="2-group.html#h-5d6e9364-75e0-4ebc-98de-bc3ddac7601f">Group Objects</a> internal to any monoidal category</li>
</ul>
</div>
</div>

<div id="outline-container-h-a1539fb0-10c1-4691-8436-d0edc792bc37" class="outline-2">
<h2 id="h-a1539fb0-10c1-4691-8436-d0edc792bc37"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-h-a1539fb0-10c1-4691-8436-d0edc792bc37">
<ul class="org-ul">
<li>John C. Baez, Alissa S. Crans, <br>
"Higher-Dimensional Algebra VI: Lie 2-Algebras". <br>
<a href="https://arxiv.org/abs/math/0307263">arXiv:math/0307263</a>, 50 pages. &sect;2 defines internal categories,
internal functors, internal natural transformations</li>
<li>Bryce Clarke, <br>
"Internal split opfibrations and cofunctors". <br>
<a href="https://arxiv.org/abs/2004.00187">arXiv:2004.00187</a>, 25 pages.
Definitions 2.1 and 2.2 for internal categories and internal functors</li>
<li>nLab <a href="https://ncatlab.org/nlab/show/functor#InternalDefinition">Functor, internal definition</a> entry</li>
<li>Saunders MacLane, Ieke Moerdijk, <br>
<cite class="book-title">Sheaves in Geometry and Logic</cite>. <br>
Section V.5&#x2013;7 (V.5 is about internal vs external, V.6 for internal
groups, V.7 for internal categories)</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-04-11 Sun 17:48.</p>
</div>
</body>
</html>